
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ЗарегистрироватьИзменения(ДанныеСсылка) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ксп_ПланОбменаЕРП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектДляВыгрузки.Установить(ДанныеСсылка);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.ОбъектДляВыгрузки = ДанныеСсылка;
	НаборЗаписей.Записать();
		
КонецПроцедуры

Процедура УдалитьРегистрациюОбъекта(ДанныеСсылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.ксп_ПланОбменаЕРП.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ОбъектДляВыгрузки.Установить(ДанныеСсылка);
	НаборЗаписей.Записать();
		
КонецПроцедуры
