
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
Процедура ерр(текст,п1=Неопределено,
	п2=Неопределено,
	п3=Неопределено,
	п4=Неопределено,
	п5=Неопределено,
	п6=Неопределено,
	п7=Неопределено,
	п8=Неопределено,
	п9=Неопределено,
	п10=Неопределено) экспорт
	
	рез = СтрШаблон(текст, п1, п2, п3, п4, п5, п6, п7, п8, п9, п10);
	ЗаписьЖурналаРегистрации("логгер", УровеньЖурналаРегистрации.Ошибка,,,рез);
КонецПроцедуры

Процедура варн(текст,п1=Неопределено,
	п2=Неопределено,
	п3=Неопределено,
	п4=Неопределено,
	п5=Неопределено,
	п6=Неопределено,
	п7=Неопределено,
	п8=Неопределено,
	п9=Неопределено,
	п10=Неопределено) экспорт
		
	рез = СтрШаблон(текст, п1, п2, п3, п4, п5, п6, п7, п8, п9, п10);
	ЗаписьЖурналаРегистрации("логгер", УровеньЖурналаРегистрации.Предупреждение,,,рез);
КонецПроцедуры

Процедура инфо(текст,п1=Неопределено,
	п2=Неопределено,
	п3=Неопределено,
	п4=Неопределено,
	п5=Неопределено,
	п6=Неопределено,
	п7=Неопределено,
	п8=Неопределено,
	п9=Неопределено,
	п10=Неопределено) экспорт
	рез = СтрШаблон(текст, п1, п2, п3, п4, п5, п6, п7, п8, п9, п10);
	ЗаписьЖурналаРегистрации("логгер", УровеньЖурналаРегистрации.Информация,,,рез);
		
КонецПроцедуры

Процедура дебаг(текст,п1=Неопределено,
	п2=Неопределено,
	п3=Неопределено,
	п4=Неопределено,
	п5=Неопределено,
	п6=Неопределено,
	п7=Неопределено,
	п8=Неопределено,
	п9=Неопределено,
	п10=Неопределено) экспорт
	рез = СтрШаблон(текст, п1, п2, п3, п4, п5, п6, п7, п8, п9, п10);
	ЗаписьЖурналаРегистрации("логгер", УровеньЖурналаРегистрации.Информация,,,рез);
		
КонецПроцедуры

Процедура крит(текст,п1=Неопределено,
	п2=Неопределено,
	п3=Неопределено,
	п4=Неопределено,
	п5=Неопределено,
	п6=Неопределено,
	п7=Неопределено,
	п8=Неопределено,
	п9=Неопределено,
	п10=Неопределено) экспорт
	рез = СтрШаблон(текст, п1, п2, п3, п4, п5, п6, п7, п8, п9, п10);
	ЗаписьЖурналаРегистрации("логгер", УровеньЖурналаРегистрации.Ошибка,,,рез);
		
КонецПроцедуры
