
// Описание_метода
//
// Параметры:
//	Параметр1 	- Тип1 - 
//
// Возвращаемое значение:
//	Тип: Тип_значения
//
Функция ДобавитьЗапись(ДокументСсылка, НомерЕРП, ГУИДЕРП) Экспорт
	
	НЗ = РегистрыСведений.ксп_СоответствиеДокументовУстановкаПорядковыхНомеров.СоздатьНаборЗаписей();
	НЗ.Отбор.ДокументСсылка.Установить(ДокументСсылка);
	НовСтр = НЗ.Добавить();
	НовСтр.ДокументСсылка = ДокументСсылка;
	НовСтр.НомерДокументаЕРП = НомерЕРП;
	НовСтр.ГУИДЕРП = ГУИДЕРП;
	
	НЗ.Записать();
	
		
КонецФункции
